app/views/owners/index.html.erb

SELECT COUNT(*) FROM "pets" WHERE "pets"."owner_id" = 1
---
        <td><%= owner.phone %></td>
        <td><%= owner.pets.count %></td>