app/views/owners/show.html.erb

  <tbody>
    <% @owner.pets.each do |pet| %>
---
SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" = 1