app/views/pets/show.html.erb

  <strong>Owner:</strong>
  <%= link_to "#{@pet.owner.first_name} #{@pet.owner.last_name}", @pet.owner %>
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = 1 LIMIT 1

  <tbody>
    <% @pet.appointments.upcoming.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1

        <td>
          <%= link_to "#{appointment.vet.first_name} #{appointment.vet.last_name}", appointment.vet %>
---
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1 LIMIT 1