app/views/vets/show.html.erb

  <tbody>
    <% @vet.appointments.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."vet_id" = 1