app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets"
---
  def index
    @pets = Pet.includes(:owner)

SELECT "pets".* FROM "pets" WHERE "pets"."id" = 1 LIMIT 1
SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" = 1
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1
---
  def show
    @pet = Pet.includes(appointments: [:vet, :treatments]).find(params[:id])